export default [
  {
    id: "q1",
    text: "1.Яке з наступних визначень найкраще описує React.js?",
    answers: [
      "Бібліотека для створення інтерфейсів користувача за допомогою декларативного коду.",
      "Бібліотека для управління станом у веб-застосунках.",
      "Фреймворк для створення інтерфейсів користувача за допомогою імперативного коду.",
      "Бібліотека, що використовується лише для створення мобільних застосунків.",
    ],
  },
  {
    id: "q2",
    text: "2.Яке призначення хуків у React?",
    answers: [
      "Надають можливість використовувати стан та інші функції React у функціональних компонентах.",
      "Створення адаптивних макетів у React-застосунках.",
      "Обробка помилок у межах застосунку.",
      "Частина бібліотеки Redux для управління глобальним станом.",
    ],
  },
  {
    id: "q3",
    text: "3.Що таке JSX?",
    answers: [
      "Розширення JavaScript, яке додає HTML-подібний синтаксис до JavaScript.",
      "Бібліотека JavaScript для створення динамічних інтерфейсів користувача.",
      "Спеціальна версія HTML, створена спеціально для React.",
      "Інструмент для здійснення HTTP-запитів у React-застосунку.",
    ],
  },
  {
    id: "q4",
    text: "4.Який найпоширеніший спосіб створення компонента в React?",
    answers: [
      "Визначення JavaScript-функції, яка повертає значення, що можна відобразити.",
      "Визначення власного HTML-тега в JavaScript.",
      "Створення файлу з розширенням .jsx.",
      'Використання ключового слова "new" перед назвою компонента.',
    ],
  },
  {
    id: "q5",
    text: '5.Що означає термін "стан React"?',
    answers: [
      "Обʼєкт у компоненті, який зберігає значення та може викликати повторний рендер при зміні.",
      "Фаза життєвого циклу компонента React.",
      "Загальний стан React-застосунку, включаючи всі пропси та компоненти.",
      "Бібліотека для управління глобальним станом у React-застосунках.",
    ],
  },
  {
    id: "q6",
    text: "6.Як зазвичай відображають список у React-застосунках?",
    answers: [
      "За допомогою методу map(), щоб пройтись по масиву даних і повернути JSX.",
      "За допомогою циклу for(), щоб пройтись по масиву даних і повернути JSX.",
      "За допомогою методу forEach(), щоб пройтись по масиву даних і повернути JSX.",
      "За допомогою методу loop(), щоб пройтись по масиву даних і повернути JSX.",
    ],
  },
  {
    id: "q7",
    text: "7.Який підхід НЕ можна використовувати для умовного рендерингу?",
    answers: [
      "Використання синтаксису шаблону #if.",
      "Використання тернарного оператора.",
      "Використання оператора &&.",
      "Використання умовного оператора if-else.",
    ],
  },
];
